### Employees

### Import dependencies

In [33]:
import pandas as pd
from sqlalchemy import create_engine
import os
from config import password

In [34]:
# Create engine to  connect to postgres database and get data
engine = create_engine(f"postgres://postgres:{password}@localhost:5432/sql_challenge")

In [35]:
# Use pd.read_sql to read in the results table to include all columns from employees, employees salary and employess title
employees_df = pd.read_sql("SELECT * FROM employees", engine)
titles_df = pd.read_sql("SELECT * from titles", engine)
salaries_df = pd.read_sql ("SELECT * from salaries", engine)

In [39]:
# Join employees_df and titles_df and salaries_df
employee_master_df = pd.merge(employees_df, titles_df, left_on="emp_title_id", right_on="title_id", how="left")
employee_master_df = pd.merge(employee_master_df, salaries_df, on="emp_no", how="left")

In [40]:
employee_master_df.head()

,emp_no,emp_title_id,birthdate,first_name,last_name,sex,hire_date,title_id,title,salary
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28,s0001,Staff,40000
1,475053,e0002,1954-11-18,Byong,Delgrande,F,1991-09-07,e0002,Engineer,53422
2,57444,e0002,1958-01-30,Berry,Babb,F,1992-03-21,e0002,Engineer,48973
3,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26,s0001,Staff,40000
4,282238,e0003,1952-10-28,Abdelkader,Baumann,F,1991-01-18,e0003,Senior Engineer,40000

In [41]:
salary = employee_master_df["salary"]

In [44]:
salary.max()

129492